Revit 2026 API

# IExternalApplication Interface

---

An interface that supports addition of external applications to Revit.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalApplication
```
```vb
Public Interface IExternalApplication
```
```cpp
public interface class IExternalApplication
```
```fsharp
type IExternalApplication = interface end
```

The IExternalApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down. |
|  | OnStartup | Implement this method to execute some tasks when Autodesk Revit starts. |

External applications are permitted to customize the Revit UI, and to add events and updaters to the session.

#### Reference

Autodesk.Revit.UI Namespace